# SpacingNumDivisionsVert Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpacingNumDivisionsVert Property
ParameterTypeId Class See Also
---
"Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpacingNumDivisionsVert { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpacingNumDivisionsVert As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpacingNumDivisionsVert {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace